configuration/src/InformationRegisters/ОписаниеИзмененийКЗадачам/ОписаниеИзмененийКЗадачам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОписаниеИзмененийКЗадачам</name>
  <resources>
    <name>ВидДайджеста</name>
    <type>
      <types>EnumRef.ВидыДайджестов</types>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <comment>Текст изменений в формате Markdown</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Опубликовано</name>
    <comment>Признак того, что изменение готово к публикации в дайджесте</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПубликации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеИзмененийСистемы</name>
    <type>
      <types>CatalogRef.ОписанияИзмененийСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипИзменения</name>
    <type>
      <types>EnumRef.ТипыИзмененийСистемы</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ОписаниеИзмененийКЗадачам/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ОтметитьОпубликованым(Знач ОпубликованныеОписания) Экспорт
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Для Каждого ОпубликованноеОписание Из ОпубликованныеОписания Цикл
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Задача = ОпубликованноеОписание.Задача;
		МенеджерЗаписи.ДатаДобавления = ОпубликованноеОписание.ДатаДобавления;
		МенеджерЗаписи.Прочитать();
		
		МенеджерЗаписи.ДатаПубликации = ТекущаяДата;
		
		Если ОпубликованноеОписание.Свойство("Опубликовано") Тогда 
			МенеджерЗаписи.Опубликовано = ОпубликованноеОписание.Опубликовано;
		Иначе 
			МенеджерЗаписи.Опубликовано = Истина;
		КонецЕсли;   
		
		Если НЕ МенеджерЗаписи.Опубликовано Тогда 
			МенеджерЗаписи.ОписаниеИзмененийСистемы = Справочники.ОписанияИзмененийСистемы.ПустаяСсылка();
		ИначеЕсли  ОпубликованноеОписание.Свойство("ОписаниеИзмененийСистемы") Тогда 
			МенеджерЗаписи.ОписаниеИзмененийСистемы = ОпубликованноеОписание.ОписаниеИзмененийСистемы;
		КонецЕсли; 
		
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
